app/controllers/projects_controller.rb

SELECT `projects`.* FROM `projects` WHERE ((user_id = 1 AND assigned_to IS NULL) OR assigned_to = 1) AND ((due_at IS NULL AND bucket = 'due_later') OR due_at >= '2011-08-15 23:59:59') AND (completed_at IS NULL) ORDER BY name ASC, projects.id DESC, projects.due_at, projects.id
---
  def index
    @view = params[:view] || "pending"
puts @view

    @projects = Project.find_all_grouped(@current_user, @view)