app/controllers/tasks_controller.rb

SELECT `tasks`.* FROM `tasks` WHERE `tasks`.`deleted_at` IS NULL AND ((user_id = 1 AND assigned_to IS NULL) OR assigned_to = 1) AND ((due_at IS NULL AND bucket = 'due_later') OR due_at >= '2011-08-15 23:59:59') AND (completed_at IS NULL) ORDER BY name ASC, tasks.id DESC, tasks.due_at, tasks.id
---
  def index
    @view = params[:view] || "pending"
puts "HIIIIIIIIIIIIIIIIIIIIIIIIIIIIIIIIIIIIIII" + @view
    @tasks = Task.find_all_grouped(@current_user, @view)

SELECT `tasks`.* FROM `tasks` WHERE `tasks`.`deleted_at` IS NULL AND `tasks`.`id` = 1 AND (user_id = 1 OR assigned_to = 1) LIMIT 1
---
  def edit
    @view = params[:view] || "pending"
    @task = Task.tracked_by(@current_user).find(params[:id])

INSERT INTO `tasks` (`user_id`, `assigned_to`, `completed_by`, `name`, `asset_id`, `asset_type`, `priority`, `category`, `bucket`, `due_at`, `completed_at`, `deleted_at`, `created_at`, `updated_at`, `background_info`) VALUES (1, NULL, NULL, 'Publicity', NULL, '', NULL, 'presentation', 'due_tomorrow', '2011-08-06 00:00:00', NULL, NULL, '2011-08-05 06:03:42', '2011-08-05 06:03:42', NULL)
---
  def create
    @task = Task.new(params[:task]) # NOTE: we don't display validation messages for tasks.
    @view = params[:view] || "pending"

    respond_to do |format|
      if @task.save